Revit 2027 API
SelectionFilterElement.GetElementIds Method
 Returns the set of ElementIds contained by this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetElementIds()
Public Function GetElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetElementIds()
member GetElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The set of ElementIds.
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace